# The Series Data Structure

In [1]:
#pandas import
import pandas as pd
pd.Series?

In [2]:
animals = ['Tiger','Bear','Moose']
animals

['Tiger', 'Bear', 'Moose']

In [3]:
# input pandas
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [4]:
# input (integer Type)
numbers = [1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [5]:
# input (String, None Type)
animals = ['Tiger','Bear',None]
pd.Series(animals)

0    Tiger
1     Bear
2     None
dtype: object

In [6]:
# input (integer, None Type)
numbers = [1,2,None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
import numpy as np

In [8]:
np.nan == None

False

In [9]:
np.nan == np.nan

False

In [10]:
# check NAN(not a number)
np.isnan(np.nan)

True

In [11]:
# input pandas ( Dictionary )
sports = {'Archery': 'Bhutan',
        'Golf': 'Scotland',
        'Sumo': 'Japan',
        'Taekwondo':'South Korea'}
s = pd.Series(sports)

In [12]:
# Auto Key, value
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [13]:
# attribute 확인
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [14]:
# Self Indexing in pandas
s1 = pd.Series(['Tiger','Bear','Moose'], index = ['indea','America','canada'])

In [15]:
s1

indea      Tiger
America     Bear
canada     Moose
dtype: object

In [16]:
# 원하는 인덱스를 지정하여 입력 가능
s2 = pd.Series(sports, index=['Golf','Sumo'])
s2

Golf    Scotland
Sumo       Japan
dtype: object

# Querying a Series Data Structure

In [17]:
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [18]:
# data 찾기 (보이진 않지만 index존재)
# 순서로 데이터 접근( not method, 단지 속성이다)
s.iloc[2]

'Japan'

In [19]:
# key로 데이터 접근( not method, 단지 속성이다)
s.loc['Taekwondo']

'South Korea'

In [20]:
# 이렇게도 가능하지만, 간혹 iloc과 다른 결과가 나온다
s[2]

'Japan'

In [21]:
s['Taekwondo']

'South Korea'

In [22]:
# 간혹 s[2]와 iloc이 다른 결과가 나온다 그 예시
# 재정의
sports = {5: 'Bhutan',
        6: 'Scotland',
        7: 'Japan',
        8:'South Korea'}
s3 = pd.Series(sports)
s3

5         Bhutan
6       Scotland
7          Japan
8    South Korea
dtype: object

In [23]:
# 정확한 접근
s3.iloc[0]

'Bhutan'

In [24]:
# 잘못된 인덱스 접근으로 오류가 난다
s3.loc[0]

KeyError: 0

In [25]:
# input integer
s4 = pd.Series([100,120,101,3])
s4

0    100
1    120
2    101
3      3
dtype: int64

In [26]:
# pandas에서 요소의 합
total = 0
for item in s4:
    total += item
print(total)

324

In [27]:
# numpy는 pandas의 data structure 을 구현하기 때문에 사용 가능
# numpy 함수를 이용한 합

total = np.sum(s4)
print(total)

324

In [28]:
# numpy 랜덤 난수를 이용 (0~1000, 만개)
s5 = pd.Series(np.random.randint(0,1000,10000))
s5

0       901
1        69
2       931
3       377
4       404
       ...
9995    516
9996    230
9997    433
9998    483
9999    253
Length: 10000, dtype: int32

In [29]:
# 맨앞 다섯개만 보여줌
s5.head()

0    901
1     69
2    931
3    377
4    404
dtype: int32

In [30]:
# 시간 복잡도 구하기
# 시간 비교
# 아래 내용을 백번 돌리고 시간을 잼
# 결과, np를 사용하는 것이 빠른 것을 볼 수 있다.

In [31]:
%%timeit -n 100
total = 0
for item in s5:
    total +=item

2.92 ms ± 813 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [32]:
%%timeit -n 100
total = np.sum(s5)

273 µs ± 92.1 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [33]:
# Add data
s6 = pd.Series([1,2,3])
s6

0    1
1    2
2    3
dtype: int64

In [34]:
# 원하는 key 에 값 input type도 object로 바뀜
s6.loc['Animal'] = 'Bears'
s6

0             1
1             2
2             3
Animal    Bears
dtype: object

In [35]:
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [36]:
cricket_contries = pd.Series(['Australia','Pakistan' ,'England'], index = ['Cricket','Cricket','Cricket'])
cricket_contries

Cricket    Australia
Cricket     Pakistan
Cricket      England
dtype: object

In [37]:
# 붙이기
all_countries = s.append(cricket_contries)
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Pakistan
Cricket          England
dtype: object

In [38]:
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [39]:
# key로 값 찾기
all_countries.loc['Cricket']

Cricket    Australia
Cricket     Pakistan
Cricket      England
dtype: object

In [40]:
all_countries.loc['Sumo']

'Japan'

# The DataFrame Data Structure

In [41]:
# DFDS는 Series를 여러번 붙이는걸 의미
purchase_1 = pd.Series({'Name': 'Chris',
                       'item Purchased': 'Dog Food',
                       'Cost' : 22.50})
purchase_2 = pd.Series({'Name': 'Kevin',
                       'item Purchased': 'Kitty Litter',
                       'Cost' : 2.50})
purchase_3 = pd.Series({'Name': 'Chris',
                       'item Purchased': 'Bird Seed',
                       'Cost' : 5.0})

In [42]:
purchase_1

Name                 Chris
item Purchased    Dog Food
Cost                  22.5
dtype: object

In [43]:
# 여러 series를 이용해 DataFrame 생성
df = pd.DataFrame([purchase_1, purchase_2,purchase_3], index = ['Store 1','Store 2','Store 1'])
df.head()

          Name item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevin   Kitty Litter   2.5
Store 1  Chris      Bird Seed   5.0

In [44]:
# 데이터 확인

In [45]:
df.loc['Store 2']

Name                     Kevin
item Purchased    Kitty Litter
Cost                       2.5
Name: Store 2, dtype: object

In [46]:
df.loc['Store 1']

          Name item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Chris      Bird Seed   5.0

In [47]:
df.loc['Store 1']['Cost']

Store 1    22.5
Store 1     5.0
Name: Cost, dtype: float64

In [48]:
df.loc['Store 1','Cost']

Store 1    22.5
Store 1     5.0
Name: Cost, dtype: float64

In [49]:
# row column 스위칭
df.T

                 Store 1       Store 2    Store 1
Name               Chris         Kevin      Chris
item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [50]:
df.T.loc['Cost']

Store 1    22.5
Store 2     2.5
Store 1       5
Name: Cost, dtype: object

In [51]:
df['Cost']

Store 1    22.5
Store 2     2.5
Store 1     5.0
Name: Cost, dtype: float64

In [52]:
df.loc[:,['Name','Cost']]
# SQL Query: select Name, Cost from df

          Name  Cost
Store 1  Chris  22.5
Store 2  Kevin   2.5
Store 1  Chris   5.0

In [53]:
# data 삭제
# 비파괴적, 실제 데이터는 지워지지 않음
df.drop('Store 1')

          Name item Purchased  Cost
Store 2  Kevin   Kitty Litter   2.5

In [54]:
df

          Name item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevin   Kitty Litter   2.5
Store 1  Chris      Bird Seed   5.0

In [55]:
# index 부분삭제
copy_df = df.drop('Store 1')
copy_df

          Name item Purchased  Cost
Store 2  Kevin   Kitty Litter   2.5

In [56]:
df

          Name item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevin   Kitty Litter   2.5
Store 1  Chris      Bird Seed   5.0

In [57]:
# column 부분 삭제
del df['Name']

In [58]:
df

        item Purchased  Cost
Store 1       Dog Food  22.5
Store 2   Kitty Litter   2.5
Store 1      Bird Seed   5.0

In [59]:
# column 추가
df['Location'] = None

In [60]:
df

        item Purchased  Cost Location
Store 1       Dog Food  22.5     None
Store 2   Kitty Litter   2.5     None
Store 1      Bird Seed   5.0     None